<details><summary>Digger run report at 2023-10-15 12:34:38 (UTC)</summary>
                        <details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_argocd-apps</b></summary>
  
```terraform
Terraform will perform the following actions:

  # kubernetes_manifest.argocd_apps[0] will be created
  + resource "kubernetes_manifest" "argocd_apps" {
      + manifest = {
          + apiVersion = "argoproj.io/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + annotations = {}
              + finalizers  = [
                  + "resources-finalizer.argocd.argoproj.io",
                ]
              + name        = "alpha-k8s"
              + namespace   = "argocd"
            }
          + spec       = {
              + destination = {
                  + server = "https://kubernetes.default.svc"
                }
              + project     = "default"
              + source      = {
                  + path           = "apps"
                  + repoURL        = "https://github.com/rimvydascivilis/alpha-k8s.git"
                  + targetRevision = "main"
                }
              + syncPolicy  = {
                  + automated   = {
                      + allowEmpty = true
                      + prune      = true
                      + selfHeal   = true
                    }
                  + syncOptions = [
                      + "Validate=true",
                      + "CreateNamespace=true",
                      + "PrunePropagationPolicy=Foreground",
                      + "PruneLast=true",
                    ]
                }
            }
        }
      + object   = {
          + apiVersion = "argoproj.io/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = [
                  + "resources-finalizer.argocd.argoproj.io",
                ]
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "alpha-k8s"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + operation  = {
              + info        = (known after apply)
              + initiatedBy = {
                  + automated = (known after apply)
                  + username  = (known after apply)
                }
              + retry       = {
                  + backoff = {
                      + duration    = (known after apply)
                      + factor      = (known after apply)
                      + maxDuration = (known after apply)
                    }
                  + limit   = (known after apply)
                }
              + sync        = {
                  + dryRun       = (known after apply)
                  + manifests    = (known after apply)
                  + prune        = (known after apply)
                  + resources    = (known after apply)
                  + revision     = (known after apply)
                  + revisions    = (known after apply)
                  + source       = {
                      + chart          = (known after apply)
                      + directory      = {
                          + exclude = (known after apply)
                          + include = (known after apply)
                          + jsonnet = {
                              + extVars = (known after apply)
                              + libs    = (known after apply)
                              + tlas    = (known after apply)
                            }
                          + recurse = (known after apply)
                        }
                      + helm           = {
                          + fileParameters          = (known after apply)
                          + ignoreMissingValueFiles = (known after apply)
                          + parameters              = (known after apply)
                          + passCredentials         = (known after apply)
                          + releaseName             = (known after apply)
                          + skipCrds                = (known after apply)
                          + valueFiles              = (known after apply)
                          + values                  = (known after apply)
                          + valuesObject            = (known after apply)
                          + version                 = (known after apply)
                        }
                      + kustomize      = {
                          + commonAnnotations         = (known after apply)
                          + commonAnnotationsEnvsubst = (known after apply)
                          + commonLabels              = (known after apply)
                          + forceCommonAnnotations    = (known after apply)
                          + forceCommonLabels         = (known after apply)
                          + images                    = (known after apply)
                          + namePrefix                = (known after apply)
                          + nameSuffix                = (known after apply)
                          + namespace                 = (known after apply)
                          + replicas                  = (known after apply)
                          + version                   = (known after apply)
                        }
                      + path           = (known after apply)
                      + plugin         = {
                          + env        = (known after apply)
                          + name       = (known after apply)
                          + parameters = (known after apply)
                        }
                      + ref            = (known after apply)
                      + repoURL        = (known after apply)
                      + targetRevision = (known after apply)
                    }
                  + sources      = (known after apply)
                  + syncOptions  = (known after apply)
                  + syncStrategy = {
                      + apply = {
                          + force = (known after apply)
                        }
                      + hook  = {
                          + force = (known after apply)
                        }
                    }
                }
            }
          + spec       = {
              + destination          = {
                  + name      = (known after apply)
                  + namespace = (known after apply)
                  + server    = "https://kubernetes.default.svc"
                }
              + ignoreDifferences    = (known after apply)
              + info                 = (known after apply)
              + project              = "default"
              + revisionHistoryLimit = (known after apply)
              + source               = {
                  + chart          = (known after apply)
                  + directory      = {
                      + exclude = (known after apply)
                      + include = (known after apply)
                      + jsonnet = {
                          + extVars = (known after apply)
                          + libs    = (known after apply)
                          + tlas    = (known after apply)
                        }
                      + recurse = (known after apply)
                    }
                  + helm           = {
                      + fileParameters          = (known after apply)
                      + ignoreMissingValueFiles = (known after apply)
                      + parameters              = (known after apply)
                      + passCredentials         = (known after apply)
                      + releaseName             = (known after apply)
                      + skipCrds                = (known after apply)
                      + valueFiles              = (known after apply)
                      + values                  = (known after apply)
                      + valuesObject            = (known after apply)
                      + version                 = (known after apply)
                    }
                  + kustomize      = {
                      + commonAnnotations         = (known after apply)
                      + commonAnnotationsEnvsubst = (known after apply)
                      + commonLabels              = (known after apply)
                      + forceCommonAnnotations    = (known after apply)
                      + forceCommonLabels         = (known after apply)
                      + images                    = (known after apply)
                      + namePrefix                = (known after apply)
                      + nameSuffix                = (known after apply)
                      + namespace                 = (known after apply)
                      + replicas                  = (known after apply)
                      + version                   = (known after apply)
                    }
                  + path           = "apps"
                  + plugin         = {
                      + env        = (known after apply)
                      + name       = (known after apply)
                      + parameters = (known after apply)
                    }
                  + ref            = (known after apply)
                  + repoURL        = "https://github.com/rimvydascivilis/alpha-k8s.git"
                  + targetRevision = "main"
                }
              + sources              = (known after apply)
              + syncPolicy           = {
                  + automated                = {
                      + allowEmpty = true
                      + prune      = true
                      + selfHeal   = true
                    }
                  + managedNamespaceMetadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  + retry                    = {
                      + backoff = {
                          + duration    = (known after apply)
                          + factor      = (known after apply)
                          + maxDuration = (known after apply)
                        }
                      + limit   = (known after apply)
                    }
                  + syncOptions              = [
                      + "Validate=true",
                      + "CreateNamespace=true",
                      + "PrunePropagationPolicy=Foreground",
                      + "PruneLast=true",
                    ]
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  ```
</details>

<details><summary>Terraform plan validation check (live_staging_argocd-apps)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_data)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_ecr</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
aws_ecr_repository.this[0]: Refreshing state... [id=app]
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1155861060]
aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=app]
aws_ecr_repository_policy.this[0]: Refreshing state... [id=app]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_ecr)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_eks</b></summary>
  
```terraform
module.kms.data.aws_partition.current: Reading...
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-staging/cluster]
data.aws_caller_identity.current: Reading...
aws_security_group.node[0]: Refreshing state... [id=sg-0ca2da153d0daf958]
aws_security_group.cluster[0]: Refreshing state... [id=sg-05890219a6bf9af90]
module.kms.data.aws_caller_identity.current: Reading...
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_partition.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
aws_iam_role.this[0]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003]
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Reading...
data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::039454511521:user/rimvydas]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004-20231015094025235500000007]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004-20231015094025105700000006]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20231015094024023800000004-20231015094025071300000005]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003-20231015094025526800000009]
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003-20231015094025511500000008]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2140828597]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=a68413f9-0ccb-432d-9e6a-8242adc0d7c3]
aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3520306298]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-283244384]
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3405753559]
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2925436700]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2725044148]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1265009655]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-540475629]
aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3414948250]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4013498392]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3651375350]
aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-883167668]
module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-staging]
aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101509404933230000000a]
aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-staging-cluster-20231015094024023800000003-2023101509404994080000000b]
aws_eks_cluster.this[0]: Refreshing state... [id=eks-staging]
time_sleep.this[0]: Refreshing state... [id=2023-10-15T09:49:37Z]
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
data.tls_certificate.this[0]: Reading...
aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-050856cd60bd80ded,Environment]
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-050856cd60bd80ded,Terraform]
data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-08ea07b3e0e6f0968]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/898DC80DAE31B13C6EA9E89085DA115C]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-staging:general-2023101509493913430000000e]
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-staging:kube-proxy]
aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-staging:vpc-cni]
aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-staging:coredns]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "eks-staging:general-2023101509493913430000000e"
      + labels                 = {}
        tags                   = {
            "Environment" = "staging"
            "Name"        = "general"
            "Terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (live_staging_eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0
- Using previously-installed hashicorp/helm v2.11.0

Terraform has been successfully initialized!
aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-autoscaler]
data.aws_eks_cluster_auth.eks: Reading...
data.aws_eks_cluster.eks: Reading...
data.aws_iam_openid_connect_provider.this: Reading...
aws_iam_policy.argocd_image_updater[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-argocd-image-updater]
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=eks-staging]
aws_iam_policy.aws_load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-load-balancer-controller]
data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/898DC80DAE31B13C6EA9E89085DA115C]
data.aws_iam_policy_document.aws_load_balancer_controller: Reading...
data.aws_iam_policy_document.argocd_image_updater: Reading...
data.aws_iam_policy_document.aws_load_balancer_controller: Read complete after 0s [id=1604338201]
data.aws_iam_policy_document.cluster_autoscaler: Reading...
aws_iam_role.aws_load_balancer_controller[0]: Refreshing state... [id=eks-staging-load-balancer-controller]
data.aws_iam_policy_document.argocd_image_updater: Read complete after 0s [id=2597480549]
data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=648629919]
aws_iam_role.argocd_image_updater[0]: Refreshing state... [id=eks-staging-argocd-image-updater]
aws_iam_role.cluster_autoscaler[0]: Refreshing state... [id=eks-staging-cluster-autoscaler]
aws_iam_role_policy_attachment.aws_load_balancer_controller[0]: Refreshing state... [id=eks-staging-load-balancer-controller-20231015095238868600000002]
aws_iam_role_policy_attachment.argocd_image_updater[0]: Refreshing state... [id=eks-staging-argocd-image-updater-20231015095238839000000001]
data.aws_eks_cluster.eks: Read complete after 0s [id=eks-staging]
aws_iam_role_policy_attachment.cluster_autoscaler[0]: Refreshing state... [id=eks-staging-cluster-autoscaler-20231015095238874300000003]
helm_release.aws_load_balancer_controller[0]: Refreshing state... [id=aws-load-balancer-controller]
helm_release.argocd_image_updater[0]: Refreshing state... [id=argocd-image-updater]
helm_release.cluster_autoscaler[0]: Refreshing state... [id=autoscaler]
helm_release.sealed_secrets[0]: Refreshing state... [id=sealed-secrets]
helm_release.argocd[0]: Refreshing state... [id=argocd]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_k8s-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-0fdb35a53cc7d2958]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-0dafe96b446f2e330]
aws_route_table.public[0]: Refreshing state... [id=rtb-08caa0c9c9706459e]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-054dd6ff9cfcbfbfe]
aws_subnet.private[1]: Refreshing state... [id=subnet-07a114273b2f53ecb]
aws_subnet.private[0]: Refreshing state... [id=subnet-0098da7f41117c74a]
aws_route_table.intra[0]: Refreshing state... [id=rtb-05854cdd8899397bb]
aws_subnet.private[2]: Refreshing state... [id=subnet-044bb744f0ec108f1]
aws_default_security_group.this[0]: Refreshing state... [id=sg-015a73e3e5eaf635d]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f32ef0a6ee18aaa0]
aws_route_table.private[0]: Refreshing state... [id=rtb-04d95bdd404c03c0d]
aws_subnet.public[0]: Refreshing state... [id=subnet-0a818e51de2690442]
aws_subnet.public[1]: Refreshing state... [id=subnet-0d614196931ce537e]
aws_subnet.public[2]: Refreshing state... [id=subnet-0c2eab2c4f3d7020a]
aws_subnet.intra[0]: Refreshing state... [id=subnet-07106ab13ddbe4a13]
aws_subnet.intra[1]: Refreshing state... [id=subnet-02196947bbadb3787]
aws_subnet.intra[2]: Refreshing state... [id=subnet-01800f024769e74dd]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0c7e46310eabb8831]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08caa0c9c9706459e1080289494]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03931237ba29b6281]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e04f1b01cf83ff9d]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0b99144a68a1d515e]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03fda326a84d08a29]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-01a6e9187b7b0a936]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05274442d688182a5]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-02d7cf62ef88790f0]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-04f4949dac053aef2]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0d2481281c6c62a03]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0de100f714a375653]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04d95bdd404c03c0d1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_vpc)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>